app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "etienne.ch.gautier@gmail.com"], ["password_digest", "$2a$10$s0VaapktiANSupy5KZVupOxHSFNVNDK6pTue1H/1rHTw.Lu3dJq/O"], ["updated_at", "2014-12-09 01:42:07.857996"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])

    if @user.update_attributes(user_params)